/* Задача 4.
 * Каталог товаров книжного магазина сохранен в виде двумерного списка List<ArrayList<String>> так,
 * что на 0-й позиции каждого внутреннего списка содержится название жанра,
 * а на остальных позициях - названия книг. Напишите метод для заполнения данной структуры.
 *
 * Поэзия      | Проза    | Док
 * Война и мир | Бородино |
 * 12 стульев  |          |
 */

package Java_Seminar3_Classwork;

public class Java_Seminar3_CW_Task4 {
    public static void main(String[] args) {

    }
}