/* Задача 2.
 * 1. Продумайте структуру класса Кот. Какие поля и методы будут актуальны для приложения, которое является
 * а) информационной системой ветеринарной клиники;
 * б) архивом выставки котов;
 * в) информационной системой Театра кошек Ю. Д. Куклачёва.
 *
 * Можно записать в текстовом виде, не обязательно реализовывать в java.
 */

package Java_Seminar6_Classwork;

public class Java_Seminar6_CW_Task2 {
    public static void main(String[] args) {
//        VetCat cat = new VetCat("Вася", "Мэй-Кун", null, null, null, 'M');
//
//        cat.setName("Барсик");
//        System.out.println(cat.getName());
//        System.out.println(cat);
    }
}