// Задача №1.
// Дано натуральное число. Требуется определить, является ли год с данным номером високосным.
// Если год является високосным, то выведите YES, иначе выведите NO.
// Напомним, что в соответствии с григорианским календарем, год является високосным,
// если его номер кратен 4, но не кратен 100, а также если он кратен 400.
//
// Input: 2016
// Output: YES
// -------------------------------------------------------------------------------

package Java_Practice;

public class Task1_CheckDate {
        public static void main(String[] args) {

// year = int(input("Введите год: "))
//
// if (not year % 4 and year % 100) or not year % 400:
// if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
//      Скобки для двух булевых выражений под and НЕобязательны, т.к. сначала выполняется and, а потом or.
//      print("-> YES (год високосный)")
// else:
//      print("-> NO (год НЕ високосный)")

        }
}